---
kind: method
id: M:Autodesk.Revit.DB.Macros.IEntryPoint.OnShutdown
source: html/ffa4f8e1-f9a6-09d1-2b9d-1e98dada4440.htm
---
# Autodesk.Revit.DB.Macros.IEntryPoint.OnShutdown Method

## Syntax (C#)
```csharp
void OnShutdown()
```